[
  {
    "id": 1,
    "assetName": "granite",
    "nameTH": "หินแกรนิต",
    "nameEN": "Granite",
    "nameSci": "Granite",
    "type": "หินอัคนี",
    "description": "หินแกรนิตเกิดจากการเย็นตัวอย่างช้ามากของแมกมาลึกใต้พื้นผิวโลก ทำให้ผลึกแร่มีขนาดใหญ่และจัดเรียงแน่นหนาจนเกิดเป็นลวดลายเฉพาะตัวที่ทนต่อการผุพังตามธรรมชาติได้ดีเยี่ยม",
    "usage": "เนื้อหินที่แข็งและผิวที่สามารถขัดให้เงางามได้ทำให้หินแกรนิตถูกนำไปใช้กับงานสถาปัตยกรรมระดับพรีเมียม เช่น เคาน์เตอร์ครัว พื้น ผนัง และอนุสาวรีย์ รวมถึงถูกใช้เป็นสัญลักษณ์ของความมั่นคงในงานออกแบบแลนด์มาร์กต่าง ๆ"
  },
  {
    "id": 2,
    "assetName": "basalt",
    "nameTH": "หินบะซอลต์",
    "nameEN": "Basalt",
    "nameSci": "Basalt",
    "type": "หินอัคนี",
    "description": "หินบะซอลต์ก่อตัวจากลาวาที่ไหลออกมาบนพื้นผิวโลกและเย็นตัวอย่างรวดเร็ว ทำให้ผลึกแร่มีขนาดเล็กมากและเกิดโครงสร้างที่ละเอียดสม่ำเสมอพร้อมสีเทาถึงดำที่เป็นเอกลักษณ์",
    "usage": "ด้วยความหนาแน่นและความทนทานสูง บะซอลต์จึงถูกนำไปใช้ในงานถนน เขื่อนกันคลื่น หินจัดสวน และแม้แต่ในการผลิตเส้นใยบะซอลต์สำหรับวัสดุคอมโพสิตที่ต้องการความทนร้อนและความแข็งแรง"
  },
  {
    "id": 3,
    "assetName": "conglomerate",
    "nameTH": "หินกรวดมน",
    "nameEN": "Conglomerate",
    "nameSci": "Conglomerate",
    "type": "หินตะกอน",
    "description": "หินกรวดมนเกิดจากการรวมตัวกันของกรวดและเศษหินหลายขนาดที่ถูกน้ำพัดพา มาทับถมและยึดติดกันด้วยตะกอนละเอียดจนแปรสภาพเป็นมวลแข็งที่สะท้อนประวัติการไหลเวียนของแม่น้ำโบราณ",
    "usage": "เม็ดกรวดที่หลากสีและรูปทรงทำให้หินกรวดมนถูกใช้เป็นวัสดุแต่งสวน ผนังตกแต่ง และแสดงลวดลายทางธรณีวิทยาในพิพิธภัณฑ์ รวมถึงช่วยสื่อสารเรื่องการสะสมตะกอนให้กับผู้เรียนได้อย่างเป็นรูปธรรม"
  },
  {
    "id": 4,
    "assetName": "pumice",
    "nameTH": "หินพัมมิซ",
    "nameEN": "Pumice",
    "nameSci": "Pumice",
    "type": "หินอัคนี",
    "description": "หินพัมมิซเกิดจากลาวาที่อุดมไปด้วยฟองก๊าซและเย็นตัวในทันที ทำให้เกิดโครงสร้างที่มีรูพรุนจำนวนมากและมีน้ำหนักเบาจนสามารถลอยน้ำได้",
    "usage": "พื้นผิวที่หยาบแต่ไม่บาดผิวทำให้พัมมิซนิยมใช้ขัดผิวกาย ขัดเครื่องประดับ หรือเป็นสารเติมแต่งในวัสดุก่อสร้างเพื่อให้มีฉนวนกันความร้อนและน้ำหนักเบา ตอบโจทย์งานออกแบบที่ต้องการความยืดหยุ่นและแรงบันดาลใจ"
  },
  {
    "id": 5,
    "assetName": "obsidian",
    "nameTH": "หินออบซิเดียน",
    "nameEN": "Obsidian",
    "nameSci": "Obsidian",
    "type": "หินอัคนี",
    "description": "หินออบซิเดียนเกิดจากลาวาที่เย็นตัวอย่างรวดเร็วมากจนไม่มีผลึก ทำให้มีผิวเรียบมันแวววาวเหมือนแก้วสีดำ",
    "usage": "เพราะคมมากเมื่อแตก ออบซิเดียนจึงเคยถูกใช้ทำหัวลูกธนูและมีด เครื่องประดับ และเป็นสื่อให้ครูอธิบายเรื่องการเย็นตัวของลาวาอย่างรวดเร็ว"
  },
  {
    "id": 6,
    "assetName": "diorite",
    "nameTH": "หินไดออไรต์",
    "nameEN": "Diorite",
    "nameSci": "Diorite",
    "type": "หินอัคนี",
    "description": "หินไดออไรต์เกิดจากแมกมาที่เย็นตัวใต้พื้นดินด้วยความเร็วปานกลาง ทำให้ผลึกสีดำและขาวผสมกันคล้ายแกรนิตแต่เนื้อแข็งหยาบกว่า",
    "usage": "ก้อนไดออไรต์มักถูกใช้ปูพื้น ทำกำแพง หรือเป็นตัวอย่างในห้องเรียนเพื่อเปรียบเทียบความแตกต่างของหินอัคนีเนื้อหยาบแต่ละชนิด"
  },
  {
    "id": 7,
    "assetName": "rhyolite",
    "nameTH": "หินไรโอไรต์",
    "nameEN": "Rhyolite",
    "nameSci": "Rhyolite",
    "type": "หินอัคนี",
    "description": "หินไรโอไรต์เกิดจากลาวาที่มีซิลิกาสูงเย็นตัวบนผิวโลก ทำให้ผิวละเอียดและมีสีอ่อนออกชมพูหรือเทาอ่อน",
    "usage": "ชั้นเรียนธรณีมักใช้ไรโอไรต์เพื่อเปรียบเทียบกับแกรนิต และในชีวิตจริงสามารถนำไปทำกรวดประดับสวนหรือหินตัดสำหรับงานตกแต่ง"
  },
  {
    "id": 8,
    "assetName": "gabbro",
    "nameTH": "หินแกบโบร",
    "nameEN": "Gabbro",
    "nameSci": "Gabbro",
    "type": "หินอัคนี",
    "description": "หินแกบโบรเกิดจากแมกมาที่มีแมกนีเซียมและเหล็กสูงเย็นตัวลึกใต้ดิน ทำให้ผลึกสีเข้มขนาดใหญ่และเนื้อแน่น",
    "usage": "เพราะทนทานและมีสีดำสวย ก้อนแกบโบรจึงนิยมนำไปทำหินประดับ ปูพื้นลาน และใช้สอนเรื่ององค์ประกอบของเปลือกโลกชั้นล่าง"
  },
  {
    "id": 9,
    "assetName": "andesite",
    "nameTH": "หินแอนดีไซต์",
    "nameEN": "Andesite",
    "nameSci": "Andesite",
    "type": "หินอัคนี",
    "description": "หินแอนดีไซต์เกิดจากลาวาในเขตภูเขาไฟที่เย็นตัวเร็วปานกลาง ทำให้ผิวละเอียดและมีจุดผลึกสีสว่างกระจายอยู่",
    "usage": "ช่างก่อสร้างบางพื้นที่ใช้แอนดีไซต์ทำอิฐและกรวด ส่วนในห้องเรียนใช้เปรียบเทียบกับบะซอลต์เพื่ออธิบายภูเขาไฟตามแนวเทือกเขา"
  },
  {
    "id": 10,
    "assetName": "scoria",
    "nameTH": "หินสโคเรีย",
    "nameEN": "Scoria",
    "nameSci": "Scoria",
    "type": "หินอัคนี",
    "description": "หินสโคเรียเกิดจากลาวาที่มีฟองก๊าซจำนวนมากพุ่งออกมาจนเกิดรูพรุนเต็มทั้งก้อนและมีสีแดงเข้มหรือดำ",
    "usage": "รูพรุนช่วยให้สโคเรียเบาและระบายน้ำดี จึงนิยมใช้รองกระถาง หินภูเขาไฟตกแต่งสวน และเป็นตัวอย่างอธิบายแรงดันก๊าซในภูเขาไฟ"
  },
  {
    "id": 11,
    "assetName": "sandstone",
    "nameTH": "หินทราย",
    "nameEN": "Sandstone",
    "nameSci": "Sandstone",
    "type": "หินตะกอน",
    "description": "หินทรายเกิดจากเม็ดทรายที่ถูกน้ำหรือพัดด้วยลมมาทับถมกันจนแข็งตัว โดยลวดลายจะแสดงชั้นการสะสมที่ชัดเจน",
    "usage": "หินทรายถูกนำมาใช้สร้างกำแพง พื้น หรือทำเป็นหินโม่ และยังใช้ในชั้นเรียนเพื่อสาธิตการทับถมของตะกอน"
  },
  {
    "id": 12,
    "assetName": "shale",
    "nameTH": "หินดินดาน",
    "nameEN": "Shale",
    "nameSci": "Shale",
    "type": "หินตะกอน",
    "description": "หินดินดานเกิดจากโคลนและดินละเอียดที่อัดแน่นจนเป็นแผ่นบาง แตกเป็นชั้นได้ง่าย",
    "usage": "เพราะผ่าเป็นแผ่นเรียบได้ จึงนำไปใช้มุงหลังคา ทำเครื่องปั้น หรือใช้เป็นตัวอย่างแสดงการเรียงตัวแบบชั้นบาง ๆ"
  },
  {
    "id": 13,
    "assetName": "limestone",
    "nameTH": "หินปูน",
    "nameEN": "Limestone",
    "nameSci": "Limestone",
    "type": "หินตะกอน",
    "description": "หินปูนเกิดจากเปลือกสัตว์น้ำและตะกอนแคลเซียมที่สะสมในทะเลตื้นเป็นเวลานานจนแข็ง",
    "usage": "หินปูนใช้ทำปูนซีเมนต์ ปรับสภาพดิน ลดกรดในบ่อปลา และในโรงเรียนมักใช้ทดลองกับกรดเพื่อเห็นการเกิดฟอง"
  },
  {
    "id": 14,
    "assetName": "breccia",
    "nameTH": "หินเบรชชา",
    "nameEN": "Breccia",
    "nameSci": "Breccia",
    "type": "หินตะกอน",
    "description": "หินเบรชชาเกิดจากเศษหินมุมเหลี่ยมที่ถูกยึดติดด้วยแร่หรือดินเหนียว ทำให้เห็นเศษมุมคมอย่างชัดเจน",
    "usage": "เพราะมีลวดลายเด่น เบรชชาจึงนิยมใช้ในงานตกแต่ง และช่วยให้ครูอธิบายความต่างระหว่างกรวดมนกับเศษมุมเหลี่ยม"
  },
  {
    "id": 15,
    "assetName": "siltstone",
    "nameTH": "หินทรายแป้ง",
    "nameEN": "Siltstone",
    "nameSci": "Siltstone",
    "type": "หินตะกอน",
    "description": "หินทรายแป้งเกิดจากตะกอนที่มีขนาดเล็กกว่าทรายแต่ใหญ่กว่าโคลนที่ทับถมแน่นจนแข็ง",
    "usage": "มักใช้เป็นตัวอย่างในบทเรียนเรื่องการคัดขนาดเม็ดตะกอน และบางพื้นที่นำมาสกัดเป็นหินก่อสร้างขนาดเล็ก"
  },
  {
    "id": 16,
    "assetName": "chert",
    "nameTH": "หินเชิร์ต",
    "nameEN": "Chert",
    "nameSci": "Chert",
    "type": "หินตะกอน",
    "description": "หินเชิร์ตเกิดจากซากสาหร่ายและแร่ซิลิกาที่ตกตะกอนในน้ำจนแข็งเป็นหินเนื้อแน่น",
    "usage": "เนื้อแข็งทำให้เชิร์ตเคยใช้ทำอาวุธหินและยังใช้ในห้องปฏิบัติการเพื่อแสดงการแตกแบบคมคล้ายแก้ว"
  },
  {
    "id": 17,
    "assetName": "mudstone",
    "nameTH": "หินโคลน",
    "nameEN": "Mudstone",
    "nameSci": "Mudstone",
    "type": "หินตะกอน",
    "description": "หินโคลนเกิดจากโคลนเนื้อละเอียดที่ถูกกดทับจนเป็นก้อนแน่นโดยไม่มีชั้นแตกชัดเจน",
    "usage": "หินโคลนถูกใช้ทำอิฐดินเผา วัสดุถม และช่วยให้นักเรียนเห็นผลของการกดทับแรงต่ำต่อเม็ดตะกอน"
  },
  {
    "id": 18,
    "assetName": "coal",
    "nameTH": "ถ่านหิน",
    "nameEN": "Coal",
    "nameSci": "Coal",
    "type": "หินตะกอน",
    "description": "ถ่านหินเกิดจากซากพืชในบึงชื้นที่ถูกฝังและถูกความดันสูงเป็นเวลานานจนกลายเป็นหินที่ให้พลังงาน",
    "usage": "ใช้เป็นเชื้อเพลิงผลิตไฟฟ้า และในชั้นเรียนใช้ยกตัวอย่างทรัพยากรธรรมชาติที่เกิดขึ้นช้ามาก"
  },
  {
    "id": 19,
    "assetName": "gypsum",
    "nameTH": "ยิปซัม",
    "nameEN": "Gypsum",
    "nameSci": "Gypsum",
    "type": "หินตะกอน",
    "description": "ยิปซัมเกิดจากน้ำทะเลหรือทะเลสาบที่ระเหยจนเหลือแร่แคลเซียมซัลเฟตตกผลึกเป็นชั้น",
    "usage": "ผงยิปซัมใช้ทำปูนปลาสเตอร์ แผ่นยิปซัม และอธิบายการตกผลึกของน้ำเค็มในบทเรียนวิทยาศาสตร์"
  },
  {
    "id": 20,
    "assetName": "dolomite",
    "nameTH": "หินโดโลไมต์",
    "nameEN": "Dolomite",
    "nameSci": "Dolomite",
    "type": "หินตะกอน",
    "description": "หินโดโลไมต์เกิดจากหินปูนที่แคลเซียมบางส่วนถูกแทนที่ด้วยแมกนีเซียม ทำให้เนื้อแข็งขึ้นและมีสีเทาออกชมพู",
    "usage": "โดโลไมต์ใช้ปรับปรุงดิน เพิ่มแมกนีเซียมในปุ๋ย และเป็นตัวอย่างให้เห็นว่าหินสามารถเปลี่ยนองค์ประกอบทางเคมีได้"
  },
  {
    "id": 21,
    "assetName": "marble",
    "nameTH": "หินอ่อน",
    "nameEN": "Marble",
    "nameSci": "Marble",
    "type": "หินแปร",
    "description": "หินอ่อนเกิดจากหินปูนที่ถูกความร้อนและแรงกดจนผลึกใหม่เติบโตเป็นผิวลื่นลายสวย",
    "usage": "นิยมนำไปแกะสลักและปูพื้นหรู และในห้องเรียนใช้เปรียบเทียบกับหินปูนเพื่ออธิบายการแปรสภาพ"
  },
  {
    "id": 22,
    "assetName": "slate",
    "nameTH": "หินชนวน",
    "nameEN": "Slate",
    "nameSci": "Slate",
    "type": "หินแปร",
    "description": "หินชนวนเกิดจากดินดานที่ถูกกดทับและร้อนขึ้นจนแร่เรียงตัวใหม่เป็นแผ่นบางแข็ง",
    "usage": "หินชนวนใช้ทำกระเบื้องหลังคา กระดานชนวน และเป็นสื่อสอนเรื่องการเรียงตัวของแร่หลังถูกกดทับ"
  },
  {
    "id": 23,
    "assetName": "schist",
    "nameTH": "หินชีสต์",
    "nameEN": "Schist",
    "nameSci": "Schist",
    "type": "หินแปร",
    "description": "หินชีสต์เกิดจากหินดินดานหรือหินภูเขาไฟที่ถูกความร้อนสูงจนแร่จัดเรียงเป็นแผ่นประกาย",
    "usage": "ประกายไมกาในชีสต์ช่วยให้นักเรียนมองเห็นการเรียงตัวของแร่ และในงานจริงใช้ทำกรวดประดับหรือแผ่นหินตกแต่ง"
  },
  {
    "id": 24,
    "assetName": "gneiss",
    "nameTH": "หินไนส์",
    "nameEN": "Gneiss",
    "nameSci": "Gneiss",
    "type": "หินแปร",
    "description": "หินไนส์เกิดจากแกรนิตหรือหินแปรอื่นที่ถูกแปรสภาพจนเกิดแถบสีอ่อนแก่สลับกัน",
    "usage": "ความทนทานสูงทำให้ใช้สร้างฐานอาคาร และแถบสีช่วยสอนให้นักเรียนแยกแร่ในหินแปรได้ง่าย"
  },
  {
    "id": 25,
    "assetName": "quartzite",
    "nameTH": "หินควอร์ตไซต์",
    "nameEN": "Quartzite",
    "nameSci": "Quartzite",
    "type": "หินแปร",
    "description": "หินควอร์ตไซต์เกิดจากหินทรายที่ถูกความร้อนสูงจนเม็ดควอร์ตเชื่อมติดแน่นจนแข็งมาก",
    "usage": "ใช้ทำกรวดทางรถไฟ เครื่องมือขัด และเป็นตัวอย่างว่าตะกอนเดิมยังทิ้งร่องรอยอยู่ในหินแปรได้"
  },
  {
    "id": 26,
    "assetName": "serpentine",
    "nameTH": "หินเซอร์เพนทีน",
    "nameEN": "Serpentine",
    "nameSci": "Serpentinite",
    "type": "หินแปร",
    "description": "หินเซอร์เพนทีนเกิดจากหินอัลตรมาเฟิกที่ทำปฏิกิริยากับน้ำร้อนจนมีสีเขียวคล้ำและผิวมัน",
    "usage": "นิยมนำมาขัดเป็นหินตกแต่งและใช้สอนเรื่องการเปลี่ยนสีและแร่ใหม่เมื่อหินสัมผัสน้ำร้อนในเปลือกโลก"
  },
  {
    "id": 27,
    "assetName": "amphibolite",
    "nameTH": "หินแอมฟิโบไลต์",
    "nameEN": "Amphibolite",
    "nameSci": "Amphibolite",
    "type": "หินแปร",
    "description": "หินแอมฟิโบไลต์เกิดจากหินบะซอลต์หรือหินดินดานที่ถูกแปรสภาพจนเกิดแร่ฮอร์นเบลนด์สีดำจำนวนมาก",
    "usage": "เนื้อเหนียวแน่นช่วยให้ใช้เป็นหินก่อสร้างเฉพาะจุด และในชั้นเรียนใช้เทียบกับหินต้นกำเนิดเพื่อเห็นการแปรสภาพ"
  },
  {
    "id": 28,
    "assetName": "hornfels",
    "nameTH": "หินฮอร์นเฟลส์",
    "nameEN": "Hornfels",
    "nameSci": "Hornfels",
    "type": "หินแปร",
    "description": "หินฮอร์นเฟลส์เกิดจากหินตะกอนที่อยู่ใกล้ลาวาและถูกอบจนแข็งเปราะคล้ายกระเบื้อง",
    "usage": "ใช้เป็นตัวอย่างว่าความร้อนเพียงอย่างเดียวก็แปรสภาพหินได้ และบางครั้งใช้เป็นหินบุผนังที่ต้องการผิวด้าน"
  },
  {
    "id": 29,
    "assetName": "phyllite",
    "nameTH": "หินฟิลไลต์",
    "nameEN": "Phyllite",
    "nameSci": "Phyllite",
    "type": "หินแปร",
    "description": "หินฟิลไลต์เกิดจากหินชนวนที่ถูกแปรสภาพเพิ่มจนมีผิวมันและลอนเล็ก ๆ",
    "usage": "นิยมใช้ทำหินประดับและในวิชาวิทยาศาสตร์ใช้ชี้ให้เห็นลำดับการแปรสภาพจากชนวนไปสู่ชีสต์"
  },
  {
    "id": 30,
    "assetName": "migmatite",
    "nameTH": "หินมิกมาไทต์",
    "nameEN": "Migmatite",
    "nameSci": "Migmatite",
    "type": "หินแปร",
    "description": "หินมิกมาไทต์เกิดจากหินแปรที่บางส่วนเริ่มหลอมละลายทำให้เห็นลายคล้ายน้ำวน",
    "usage": "เพราะมีทั้งส่วนแข็งและส่วนคล้ายลาวา นักเรียนจึงเข้าใจได้ว่าหินแปรและหินอัคนีเชื่อมโยงกัน และนักออกแบบใช้เป็นแผ่นตกแต่งลวดลายหรู"
  }
]
